Autodesk.Revit.DB.WorksetDefaultVisibilitySettings.GetWorksetDefaultVisibilitySettings(Autodesk.Revit.DB.Document)
Get the WorksetDefaultVisibilitySettings of the document.
Remarks:
WorksetDefaultVisibilitySettings is not available in family documents.
aDoc:
The document.
Returns:
The WorksetDefaultVisibilitySettings of the document.
Throws Autodesk.Revit.Exceptions.ArgumentException:
WorksetDefaultVisibilitySettings is not applicable to family documents.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.WorksetDefaultVisibilitySettings.SetWorksetVisibility(Autodesk.Revit.DB.WorksetId,System.Boolean)
Set the default visibility of a workset.
worksetId:
Id of the workset.
visible:
Whether the workset should be visible by default or not.
Throws Autodesk.Revit.Exceptions.ArgumentException:
There is no workset with this Id in the document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
WorksetDefaultVisibilitySettings is not applicable to family documents.
Since:
2012

Autodesk.Revit.DB.WorksetDefaultVisibilitySettings.IsWorksetVisible(Autodesk.Revit.DB.WorksetId)
Indicates whether the workset is visible by default.
worksetId:
Id of the workset.
Returns:
Whether the workset is visible by default.
Throws Autodesk.Revit.Exceptions.ArgumentException:
There is no workset with this Id in the document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
WorksetDefaultVisibilitySettings is not applicable to family documents.
Since:
2012

Autodesk.Revit.DB.WorksetDefaultVisibilitySettings
An object that manages default visibility of worksets in a document.
Remarks:
WorksetDefaultVisibilitySettings does not exist for family documents.
In case worksharing is disabled in a document, all elements are moved into a single workset;
that workset, and any worksets (re)created if worksharing is re-enabled, is visible by default regardless of any current settings.
Since:
2012